IDENTIFICATION DIVISION.
PROGRAM-ID. TASK1.
DATA DIVISION.
  WORKING-STORAGE SECTION.
  01 A PIC A(10) VALUE "  SUHAIL  ".
  01 B PIC 9(2).
  01 C PIC 9(2).
PROCEDURE DIVISION.
  INSPECT A TALLYING B FOR ALL SPACES.
  COMPUTE C = LENGTH OF A.
  COMPUTE C = C - B.
  DISPLAY A "-  " C " (LENGTH)".
STOP RUN.
