IDENTIFICATION DIVISION. 
PROGRAM-ID. HELLO.
DATA DIVISION.
  WORKING-STORAGE SECTION.
  01 WS-C.
    05 WS-A1 PIC X(9) VALUE "100".
    05 WS-B1 PIC X(9) VALUE "150".
    05 WS-C1 PIC X(9) VALUE "180".
  01 WS-D.
    05 WS-NA1 PIC 9(3).
    05 WS-NB1 PIC 9(3).
    05 WS-NC1 PIC 9(3).
  01 WS-R PIC 9(9).
PROCEDURE DIVISION.
  MOVE WS-A1 TO WS-NA1.
  MOVE WS-B1 TO WS-NB1.
  MOVE WS-C1 TO WS-NC1.
  COMPUTE WS-R = WS-NA1 + WS-NB1 + WS-NC1. 
  DISPLAY WS-R.
STOP RUN.
