       IDENTIFICATION DIVISION.
       PROGRAM-ID. NAMES.
       DATA DIVISION.
           WORKING-STORAGE SECTION.
           01 A PIC X(10) VALUE "UDAY".
           01 B PIC X(10) VALUE "KALIMUTHU".
           01 X PIC 9(2).
           01 Y PIC 9(2).
           01 E PIC 9(2).
           01 F PIC 9(2).
       PROCEDURE DIVISION.
           
           INSPECT A TALLYING X FOR ALL SPACES.
           COMPUTE Y = LENGTH OF A.
           COMPUTE Y = Y - X.
           
           INSPECT B TALLYING E FOR ALL SPACES.
           COMPUTE F = LENGTH OF B.
           COMPUTE F = F - E.

           DISPLAY A " - " Y.
           DISPLAY B " - " F.
       STOP RUN.
